Repository: hienhoceo-dpsmedia/wordpress-image-optimization-plugin
Catalog: languages/improve-image-delivery-pagespeed-*.po
Languages: vi_vn

source: Improve Image Delivery PageSpeed
vi_vn: Cải Thiện Tốc Độ Tải Hình Ảnh PageSpeed

source: Language:
vi_vn: Ngôn ngữ:

source: Boost Your PageSpeed Insights Score & Core Web Vitals
vi_vn: Tăng Điểm PageSpeed Insights & Core Web Vitals

source: Automatically convert your JPEG/PNG images to modern WebP/AVIF formats to reduce download time, improve perceived page load performance, and enhance your Largest Contentful Paint (LCP) scores for better Core Web Vitals.
vi_vn: Tự động chuyển đổi hình ảnh JPEG/PNG sang định dạng WebP/AVIF hiện đại để giảm thời gian tải xuống, cải thiện hiệu suất tải trang cảm nhận và nâng cao điểm Largest Contentful Paint (LCP) cho Core Web Vitals tốt hơn.

source: Note: This plugin defaults to Vietnamese. To permanently change language, update your WordPress admin language in Settings → General.
vi_vn: Lưu ý: Plugin này mặc định là tiếng Việt. Để thay đổi ngôn ngữ vĩnh viễn, cập nhật ngôn ngữ quản trị WordPress trong Cài đặt → Chung.

source: PageSpeed Optimization Benefits
vi_vn: Lợi Ích Tối Ưu PageSpeed

source: Improve LCP Score
vi_vn: Cải Thiện Điểm LCP

source: Reduce image file sizes by 25-50% to speed up largest image loading times.
vi_vn: Giảm kích thước file hình ảnh 25-50% để tăng tốc thời gian tải hình ảnh lớn nhất.

source: Faster Page Loads
vi_vn: Tải Trang Nhanh Hơn

source: Smaller images mean faster download times and better user experience.
vi_vn: Hình ảnh nhỏ hơn có nghĩa là thời gian tải xuống nhanh hơn và trải nghiệm người dùng tốt hơn.

source: Mobile Performance
vi_vn: Hiệu Suất Mobile

source: Especially beneficial for mobile users with slower connections.
vi_vn: Đặc biệt có lợi cho người dùng di động với kết nối chậm hơn.

source: No Server Overload
vi_vn: Không Quá Tải Máy Chủ

source: Convert images on-demand without background processing that slows your site.
vi_vn: Chuyển đổi hình ảnh theo yêu cầu mà không có xử lý nền làm chậm trang web của bạn.

source: SEO Benefits
vi_vn: Lợi Ích SEO

source: Better PageSpeed scores can improve your search engine rankings.
vi_vn: Điểm PageSpeed tốt hơn có thể cải thiện thứ hạng công cụ tìm kiếm của bạn.

source: Perfect for website owners who want to optimize their PageSpeed Insights scores and improve Core Web Vitals performance with complete control over image conversion.
vi_vn: Hoàn hảo cho chủ sở hữu trang web muốn tối ưu hóa điểm PageSpeed Insights và cải thiện hiệu suất Core Web Vitals với quyền kiểm soát hoàn toàn việc chuyển đổi hình ảnh.

source: Language Support
vi_vn: Hỗ Trợ Ngôn Ngữ

source: This plugin prioritizes Vietnamese language with English fallback.
vi_vn: Plugin này ưu tiên tiếng Việt với dự phòng tiếng Anh.

source: Quick PageSpeed Optimization - 3 Steps
vi_vn: Tối Ưu PageSpeed Nhanh - 3 Bước

source: Follow these steps to boost your PageSpeed Insights score and improve Core Web Vitals:
vi_vn: Thực hiện các bước này để tăng điểm PageSpeed Insights và cải thiện Core Web Vitals:

source: Scan for Optimization Opportunities
vi_vn: Quét Tìm Cơ Hội Tối Ưu

source: Automatically finds all JPEG/PNG images that can be optimized to improve your PageSpeed score.
vi_vn: Tự động tìm tất cả hình ảnh JPEG/PNG có thể được tối ưu hóa để cải thiện điểm PageSpeed của bạn.

source: Convert to Modern Formats
vi_vn: Chuyển Đổi Sang Định Dạng Hiện Đại

source: Converts images to WebP/AVIF formats for faster loading, smaller file sizes, and better LCP scores.
vi_vn: Chuyển đổi hình ảnh sang định dạng WebP/AVIF để tải nhanh hơn, kích thước file nhỏ hơn và điểm LCP tốt hơn.

source: Automatic Performance Setup
vi_vn: Thiết Lập Hiệu Suất Tự Động

source: Automatically handles:
vi_vn: Tự động xử lý:

source: Adds .htaccess rules if needed
vi_vn: Thêm quy tắc .htaccess nếu cần

source: Shows LiteSpeed Cache settings
vi_vn: Hiển thị cài đặt LiteSpeed Cache

source: Recommends turning off conflicting optimizations
vi_vn: Khuyến nghị tắt các tối ưu hóa xung đột

source: Start Complete Optimization
vi_vn: Bắt Đầu Tối Ưu Hoàn Chỉnh

source: This will scan images, convert to WebP/AVIF formats, add .htaccess rules (if needed), and show LiteSpeed Cache recommendations. Original images are preserved.
vi_vn: Điều này sẽ quét hình ảnh, chuyển đổi sang định dạng WebP/AVIF, thêm quy tắc .htaccess (nếu cần) và hiển thị khuyến nghị LiteSpeed Cache. Hình ảnh gốc được bảo tồn.

source: Truly One-Click:
vi_vn: Thực Sự Một Cú Nhấp:

source: No manual configuration needed - perfect for beginners!
vi_vn: Không cần cấu hình thủ công - hoàn hảo cho người mới bắt đầu!

source: Optimization Status Dashboard
vi_vn: Bảng Điều Khiển Trạng Thái Tối Ưu

source: View your current optimization progress and statistics
vi_vn: Xem tiến trình tối ưu hóa hiện tại và thống kê của bạn

source: Optimization Status
vi_vn: Trạng Thái Tối Ưu

source: Total Images
vi_vn: Tổng Số Hình Ảnh

source: Optimized
vi_vn: Đã Tối Ưu

source: Pending
vi_vn: Đang Chờ

source: Space Saved
vi_vn: Dung Lượng Tiết Kiệm

source: Storage Optimization
vi_vn: Tối Ưu Lưu Trữ

source: Last optimized:
vi_vn: Lần tối ưu cuối:

source: Format:
vi_vn: Định dạng:

source: Original images:
vi_vn: Hình ảnh gốc:

source: Thumbnail images:
vi_vn: Hình ảnh thu nhỏ:

source: Enabled
vi_vn: Đã Bật

source: Disabled
vi_vn: Đã Tắt

source: Image Thumbnail Sizes
vi_vn: Kích Thước Hình Ảnh Thu Nhỏ

source: Original
vi_vn: Gốc

source: Ready
vi_vn: Sẵn Sàng

source: No image sizes selected for optimization. Please enable at least one option in settings.
vi_vn: Không có kích thước hình ảnh nào được chọn để tối ưu hóa. Vui lòng bật ít nhất một tùy chọn trong cài đặt.

source: Optimization Settings
vi_vn: Cài Đặt Tối Ưu

source: Configure which images to optimize and quality settings
vi_vn: Cấu hình hình ảnh nào để tối ưu hóa và cài đặt chất lượng

source: Image Size Options
vi_vn: Tùy Chọn Kích Thước Hình Ảnh

source: Choose which image sizes to convert. Original images are your uploaded files, thumbnails are automatically generated smaller versions.
vi_vn: Chọn kích thước hình ảnh nào để chuyển đổi. Hình ảnh gốc là các file bạn tải lên, thu nhỏ là các phiên bản nhỏ hơn được tạo tự động.

source: Optimize Original Images
vi_vn: Tối Ưu Hình Ảnh Gốc

source: Convert the original uploaded image files
vi_vn: Chuyển đổi các file hình ảnh gốc đã tải lên

source: Optimize Thumbnail Images
vi_vn: Tối Ưu Hình Ảnh Thu Nhỏ

source: Convert all thumbnail size variants (%1$d sizes: %2$s)
vi_vn: Chuyển đổi tất cả biến thể kích thước thu nhỏ (%1$d kích thước: %2$s)

source: Conversion Settings
vi_vn: Cài Đặt Chuyển Đổi

source: Control quality and minimum size thresholds for conversion. Higher quality = larger files but better image quality.
vi_vn: Kiểm soát chất lượng và ngưỡng kích thước tối thiểu để chuyển đổi. Chất lượng cao hơn = file lớn hơn nhưng chất lượng hình ảnh tốt hơn.

source: Conversion quality
vi_vn: Chất lượng chuyển đổi

source: Recommended: 80. Higher values = better quality but larger files. Lower values = smaller files but reduced quality.
vi_vn: Khuyến nghị: 80. Giá trị cao hơn = chất lượng tốt hơn nhưng file lớn hơn. Giá trị thấp hơn = file nhỏ hơn nhưng chất lượng giảm.

source: 0–100, default 80
vi_vn: 0–100, mặc định 80

source: Min width (px)
vi_vn: Chiều rộng tối thiểu (px)

source: Min height (px)
vi_vn: Chiều cao tối thiểu (px)

source: Min file size (KB)
vi_vn: Kích thước file tối thiểu (KB)

source: Force include small images
vi_vn: Bắt buộc bao gồm hình ảnh nhỏ

source: Ignore thresholds when scanning/converting
vi_vn: Bỏ qua ngưỡng khi quét/chuyển đổi

source: Output Format Selection
vi_vn: Lựa Chọn Định Dạng Đầu Ra

source: Choose which next-generation image formats to convert your images to. The selection depends on your server capabilities and browser support.
vi_vn: Chọn định dạng hình ảnh thế hệ mới nào để chuyển đổi hình ảnh của bạn. Lựa chọn phụ thuộc vào khả năng máy chủ và hỗ trợ trình duyệt.

source: Server Conversion Capabilities
vi_vn: Khả Năng Chuyển Đổi Máy Chủ

source: ImageMagick Extension
vi_vn: Tiện Ích ImageMagick

source: Available
vi_vn: Có Sẵn

source: Not Available
vi_vn: Không Có Sẵn

source: WebP Support
vi_vn: Hỗ Trợ WebP

source: AVIF Support
vi_vn: Hỗ Trợ AVIF

source: GD Extension
vi_vn: Tiện Ích GD

source: AVIF Support (Not Available in GD)
vi_vn: Hỗ Trợ AVIF (Không Có Sẵn trong GD)

source: No Image Conversion Library Available!
vi_vn: Không Có Thư Viện Chuyển Đổi Hình Ảnh Nào!

source: Neither ImageMagick nor GD extension is available on your server. Please contact your hosting provider to install one of these extensions.
vi_vn: Cả ImageMagick và tiện ích GD đều không có sẵn trên máy chủ của bạn. Vui lòng liên hệ nhà cung cấp hosting để cài đặt một trong những tiện ích này.

source: Output Format
vi_vn: Định Dạng Đầu Ra

source: Choose which modern image format(s) to convert your images to. AVIF provides better compression but requires ImageMagick with AVIF support.
vi_vn: Chọn định dạng hình ảnh hiện đại nào để chuyển đổi hình ảnh của bạn. AVIF cung cấp nén tốt hơn nhưng yêu cầu ImageMagick có hỗ trợ AVIF.

source: WebP Only
vi_vn: Chỉ WebP

source: Convert images to WebP format only. Best compatibility, supported by most modern browsers and servers.
vi_vn: Chuyển đổi hình ảnh chỉ sang định dạng WebP. Tương thích tốt nhất, được hỗ trợ bởi hầu hết trình duyệt và máy chủ hiện đại.

source: AVIF Only
vi_vn: Chỉ AVIF

source: Convert images to AVIF format only. Better compression than WebP but requires ImageMagick with AVIF support.
vi_vn: Chuyển đổi hình ảnh chỉ sang định dạng AVIF. Nén tốt hơn WebP nhưng yêu cầu ImageMagick có hỗ trợ AVIF.

source: Requires ImageMagick with AVIF support. Contact your hosting provider.
vi_vn: Yêu cầu ImageMagick có hỗ trợ AVIF. Liên hệ nhà cung cấp hosting của bạn.

source: Both WebP and AVIF
vi_vn: Cả WebP và AVIF

source: Fully Available
vi_vn: Hoàn Toàn Có Sẵn

source: WebP Only (AVIF not available)
vi_vn: Chỉ WebP (AVIF không có sẵn)

source: Convert to both formats for maximum compatibility and performance. Browsers will automatically choose the best supported format.
vi_vn: Chuyển đổi sang cả hai định dạng để có tương thích và hiệu suất tối đa. Trình duyệt sẽ tự động chọn định dạng được hỗ trợ tốt nhất.

source: Note: Only WebP will be generated since AVIF is not available on your server.
vi_vn: Lưu ý: Chỉ WebP sẽ được tạo vì AVIF không có sẵn trên máy chủ của bạn.

source: WebP/AVIF Serving Options
vi_vn: Tùy Chọn Phục Vụ WebP/AVIF

source: LiteSpeed Cache Detected:
vi_vn: Đã Phát Hiện LiteSpeed Cache:

source: You have multiple options to serve WebP/AVIF images. Choose the method that works best for your setup:
vi_vn: Bạn có nhiều tùy chọn để phục vụ hình ảnh WebP/AVIF. Chọn phương pháp phù hợp nhất với thiết lập của bạn:

source: Option 1 (Recommended):
vi_vn: Tùy Chọn 1 (Khuyến Nghị):

source: Use LiteSpeed Cache WebP replacement feature
vi_vn: Sử dụng tính năng thay thế WebP của LiteSpeed Cache

source: Option 2:
vi_vn: Tùy Chọn 2:

source: Use .htaccess rules below for direct server-level serving
vi_vn: Sử dụng quy tắc .htaccess bên dưới để phục vụ trực tiếp ở cấp máy chủ

source: Option 3:
vi_vn: Tùy Chọn 3:

source: Use URL replacement below for PHP-level serving
vi_vn: Sử dụng thay thế URL bên dưới để phục vụ ở cấp PHP

source: No LiteSpeed Cache Detected:
vi_vn: Không Phát Hiện LiteSpeed Cache:

source: Use the options below to serve WebP/AVIF images to your visitors:
vi_vn: Sử dụng các tùy chọn bên dưới để phục vụ hình ảnh WebP/AVIF cho khách truy cập:

source: URL Replacement Method
vi_vn: Phương Pháp Thay Thế URL

source: Enable URL Replacement
vi_vn: Bật Thay Thế URL

source: Replace image URLs with WebP/AVIF versions in your site's HTML
vi_vn: Thay thế URL hình ảnh bằng phiên bản WebP/AVIF trong HTML của trang web

source: This method works alongside LiteSpeed Cache. You can use this instead of or in addition to LiteSpeed's WebP replacement feature.
vi_vn: Phương pháp này hoạt động cùng với LiteSpeed Cache. Bạn có thể sử dụng thay vì hoặc bổ sung cho tính năng thay thế WebP của LiteSpeed.

source: Note:
vi_vn: Lưu ý:

source: If you prefer LiteSpeed's method, leave this unchecked and configure LiteSpeed Cache WebP replacement instead.
vi_vn: Nếu bạn thích phương pháp của LiteSpeed, hãy để tùy chọn này không được chọn và cấu hình thay thế WebP của LiteSpeed Cache thay vào đó.

source: This option replaces image URLs in HTML output with WebP/AVIF versions when available. For better performance, consider using .htaccess rules below.
vi_vn: Tùy chọn này thay thế URL hình ảnh trong đầu ra HTML bằng phiên bản WebP/AVIF khi có sẵn. Để có hiệu suất tốt hơn, hãy xem xét sử dụng quy tắc .htaccess bên dưới.

source: .htaccess rules below provide better performance by serving WebP content while keeping original URLs and proper Content-Type headers.
vi_vn: Quy tắc .htaccess bên dưới cung cấp hiệu suất tốt hơn bằng cách phục vụ nội dung WebP trong khi giữ URL gốc và header Content-Type phù hợp.

source: .htaccess Rules Method
vi_vn: Phương Pháp Quy Tắc .htaccess

source: Status:
vi_vn: Trạng thái:

source: Step-by-Step Process:
vi_vn: Quy Trình Từng Bước:

source: Scan
vi_vn: Quét

source: Scan Images
vi_vn: Quét Hình Ảnh

source: Convert
vi_vn: Chuyển Đổi

source: Convert Pending
vi_vn: Chuyển Đổi Đang Chờ

source: Manage
vi_vn: Quản Lý

source: Remove All WebP
vi_vn: Xóa Tất Cả WebP

source: New User?
vi_vn: Người Dùng Mới?

source: Just click the big "Start Complete Optimization" button above. It will handle everything automatically - scan, convert, add .htaccess rules, and show LiteSpeed Cache recommendations!
vi_vn: Chỉ cần nhấp vào nút "Bắt Đầu Tối Ưu Hoàn Chỉnh" lớn ở trên. Nó sẽ xử lý mọi thứ tự động - quét, chuyển đổi, thêm quy tắc .htaccess và hiển thị khuyến nghị LiteSpeed Cache!

source: What are WebP/AVIF?
vi_vn: WebP/AVIF là gì?

source: WebP and AVIF are modern image formats that reduce file sizes by 25-50% without losing quality. Faster loading = better SEO!
vi_vn: WebP và AVIF là định dạng hình ảnh hiện đại giảm kích thước file 25-50% mà không mất chất lượng. Tải nhanh hơn = SEO tốt hơn!

source: Need Settings?
vi_vn: Cần Cài Đặt?

source: Default settings work great for most sites. Only change if you know what you're doing.
vi_vn: Cài đặt mặc định hoạt động tốt cho hầu hết các trang web. Chỉ thay đổi nếu bạn biết mình đang làm gì.

source: Is it Safe?
vi_vn: Có An Toàn Không?

source: Yes! Your original images are never deleted. WebP/AVIF copies are created alongside them.
vi_vn: Có! Hình ảnh gốc của bạn không bao giờ bị xóa. Bản sao WebP/AVIF được tạo cùng với chúng.

source: Image Information
vi_vn: Thông Tin Hình Ảnh

source: Total Images:
vi_vn: Tổng Hình Ảnh:

source: Optimized:
vi_vn: Đã Tối Ưu:

source: Pending:
vi_vn: Đang Chờ:

source: Optimization Summary
vi_vn: Tóm Tắt Tối Ưu

source: of
vi_vn: trong

source: images optimized
vi_vn: hình ảnh đã tối ưu

source: Space saved:
vi_vn: Dung lượng tiết kiệm:

source: WebP/AVIF Serving Methods
vi_vn: Phương Pháp Phục Vụ WebP/AVIF

source: LiteSpeed Cache detected! You have multiple options to serve WebP/AVIF images:
vi_vn: Đã phát hiện LiteSpeed Cache! Bạn có nhiều tùy chọn để phục vụ hình ảnh WebP/AVIF:

source: .htaccess rules for server-level serving
vi_vn: quy tắc .htaccess để phục vụ ở cấp máy chủ

source: URL replacement for PHP-level serving
vi_vn: thay thế URL để phục vụ ở cấp PHP

source: Consider installing LiteSpeed Cache for better performance and caching.
vi_vn: Hãy xem xét cài đặt LiteSpeed Cache để có hiệu suất và bộ nhớ đệm tốt hơn.

source: Use the WebP/AVIF serving options configured above:
vi_vn: Sử dụng các tùy chọn phục vụ WebP/AVIF đã cấu hình ở trên:

source: Option 2: Use .htaccess rules (configured above)
vi_vn: Tùy chọn 2: Sử dụng quy tắc .htaccess (đã cấu hình ở trên)

source: Option 3: Use URL replacement (configured above)
vi_vn: Tùy chọn 3: Sử dụng thay thế URL (đã cấu hình ở trên)

source: Important:
vi_vn: Quan Trọng:

source: Choose only one method to avoid conflicts. Most users prefer LiteSpeed's WebP replacement for better performance.
vi_vn: Chỉ chọn một phương pháp để tránh xung đột. Hầu hết người dùng thích thay thế WebP của LiteSpeed để có hiệu suất tốt hơn.

source: Developed by
vi_vn: Được Phát Triển Bởi

source: from
vi_vn: từ

source: Comprehensive Digital Marketing solutions for SMEs since 2017 | 5,400+ customers served
vi_vn: Giải pháp Digital Marketing toàn diện cho doanh nghiệp vừa và nhỏ từ năm 2017 | Đã phục vụ 5.400+ khách hàng

source: Rate Plugin
vi_vn: Đánh Giá Plugin

source: Support Development
vi_vn: Hỗ Trợ Phát Triển

source: Get Support
vi_vn: Nhận Hỗ Trợ

source: Optimization completed successfully! Consider rating this plugin to help other users discover it.
vi_vn: Tối ưu hóa hoàn thành thành công! Hãy xem xét đánh giá plugin này để giúp người dùng khác khám phá nó.

source: Rate Now →
vi_vn: Đánh Giá Ngay →

source: Server does not support %s format conversion.
vi_vn: Máy chủ không hỗ trợ chuyển đổi định dạng %s.

source: Neither Imagick nor GD format support is available on this server.
vi_vn: Không có hỗ trợ định dạng Imagick hoặc GD trên máy chủ này.

source: Invalid language selection
vi_vn: Lựa chọn ngôn ngữ không hợp lệ

source: Language changed successfully
vi_vn: Đã thay đổi ngôn ngữ thành công

source: , skipped %d file(s)
vi_vn: , đã bỏ qua %d file

source: , %d error(s)
vi_vn: , %d lỗi

source: Conversion failed with %d error(s).
vi_vn: Chuyển đổi thất bại với %d lỗi.

source: All %d file(s) were skipped (already converted or below thresholds).
vi_vn: Tất cả %d file đã bị bỏ qua (đã chuyển đổi hoặc dưới ngưỡng).

source: Save Settings
vi_vn: Lưu Cài Đặt

source: Settings saved successfully.
vi_vn: Đã lưu cài đặt thành công.
